In [4]:
import pandas as pd

data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]

df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
                            #index                #colunas
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
# Outra maneira de criar item na lista
'a b c d e f'.split()

['a', 'b', 'c', 'd', 'e', 'f']

In [9]:
#selecionar somente uma coluna
df[['c1']] #2 colchete mostra como tabela / 1 colchete mostra como lista

    c1
l1   1
l2   5
l3   8
l4  13

In [7]:
#selecionar mais de 1 coluna
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [10]:
df[:] #todas linhas

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [11]:
df[1:] #da linha 2 em diante

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [12]:
df[1:3] # da linha 2 até linha 3

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [13]:
df[1:3][['c1', 'c2']] #as linhas 2 e 3, somente as colunas c1 e c2

    c1  c2
l2   5   6
l3   8  10

#### CMD LOC E ILOC </n>
LOC para indices por nome
ILOC busca pelos indices de posiçao numerica

In [23]:
df.loc[['l3']] # vai criar uma series com os dados da linha L3

    c1  c2  c3  c4
l3   8  10  11  12

In [24]:
df.loc[['l4', 'l2']] #selecionando mais de 1 linha na ordem que eu desejar

    c1  c2  c3  c4
l4  13  14  15  16
l2   5   6   7   8

In [25]:
df.loc['l4', 'c3'] #Selecionando somente 1 dado da tabela, linha4 e coluna3 = 15
                # neste caso tem que ser 1 colchete, pois vai gerar somente 1 dado

15

In [29]:
df.iloc[0, 1] #seleciona primeiro a linha e depois a coluna

2

In [32]:
df.iloc[[3, 1], [1]] #seleciona as linhas 3 e 1 e a coluna 1 (c2)

    c2
l4  14
l2   6

#### <font color="yellow"> Exercicio </font>

In [33]:
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
1   Cátia     27    F    2.5     False
2   Denis     56    M    5.0     False
3    Beto     32    M   10.0      True
4   Bruna     42    F    8.2      True
5    Dara     21    F    7.0      True
6  Carlos     19    M    6.0     False
7   Alice     35    F    5.6     False

In [74]:
# Crie um DataFrame somente com os alunos reprovados 
# e mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.
#organize a tabelo pelo sexo
selecao = alunos['Aprovado'] == False
reprovados = alunos[selecao][['Nome', 'Sexo', 'Idade']].sort_values('Sexo')

reprovados

     Nome Sexo  Idade
1   Cátia    F     27
7   Alice    F     35
2   Denis    M     56
6  Carlos    M     19

In [76]:
alunos

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True
1   Cátia     27    F    2.5     False
3    Beto     32    M   10.0      True
7   Alice     35    F    5.6     False
4   Bruna     42    F    8.2      True
2   Denis     56    M    5.0     False

In [80]:
# Crie uma visualização com os três alunos mais novos.
alunos.sort_values(by = ['Idade'], inplace = True)
alunos.iloc[:3]

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
6  Carlos     19    M    6.0     False
5    Dara     21    F    7.0      True